<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>爱，死亡和机器人 | 玩味者 | 玩味者的理性空间</title>

  

  
  <meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#xFF0C;&amp;#x300A;&amp;#x7231;&amp;#xFF0C;&amp;#x6B7B;&amp;#x4EA1;&amp;#x548C;&amp;#x673A;&amp;#x5668;&amp;#x4EBA;&amp;#xFF08;Love, Death &amp;amp; Robot&amp;#xFF09;&amp;#x300B;&amp;#x5F88">
  

  
  
  <meta name="keywords" content="电影">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="爱，死亡和机器人"/>

  <meta property="og:site_name" content="玩味者"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="玩味者" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-title">
      <a href="/">玩味者</a>
    </h1>
    <p class="site-description">玩味者的理性空间</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="../../../../index.html">主页</a></li>
      
        <li><a href="../../../../archives">归档</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>爱，死亡和机器人</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/2019/04/03/爱，死亡和机器人/" rel="bookmark">
        <time class="entry-date published" datetime="2019-04-02T16:00:00.000Z">
          2019-04-03
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/01.jpg" class title="Love, Death &amp; Robot">
<p>&#x6700;&#x8FD1;&#xFF0C;&#x300A;&#x7231;&#xFF0C;&#x6B7B;&#x4EA1;&#x548C;&#x673A;&#x5668;&#x4EBA;&#xFF08;Love, Death &amp; Robot&#xFF09;&#x300B;&#x5F88;&#x591A;&#x4EBA;&#x770B;&#xFF0C;&#x6211;&#x4E5F;&#x8DDF;&#x98CE;&#x627E;&#x6765;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x611F;&#x89C9;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x77ED;&#x7247;&#x7CFB;&#x5217;&#xFF0C;&#x9664;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x77ED;&#x7247;&#x300A;&#x51B0;&#x6CB3;&#x4E16;&#x7EAA;&#x300B;&#x4E2D;&#x6709;&#x771F;&#x4EBA;&#x51FA;&#x6F14;&#x4EE5;&#x5916;&#xFF0C;&#x90FD;&#x662F;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x52A8;&#x753B;&#x3002;&#x50CF;&#x6D77;&#x62A5;&#x91CC;&#x9762;&#x5199;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;NSFW&#xFF08;Not Suitable For Work&#xFF09;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x4EBA;&#x52A8;&#x753B;&#x5408;&#x96C6;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x7684;&#x66B4;&#x529B;&#x4EE5;&#x53CA;&#x8272;&#x60C5;&#x955C;&#x5934;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5F88;&#x591A;&#x89C6;&#x9891;&#x5E73;&#x53F0;&#x4E0A;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5B8C;&#x6574;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x6574;&#x4E2A;&#x7CFB;&#x5217;&#x6709;18&#x96C6;&#xFF0C;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#xFF0C;&#x4E0B;&#x9762;&#x53EA;&#x6311;&#x51E0;&#x90E8;&#x6765;&#x804A;&#x4E00;&#x804A;</p>
<h2 id="&#x6851;&#x59AE;&#x7684;&#x4F18;&#x52BF;">&#x6851;&#x59AE;&#x7684;&#x4F18;&#x52BF;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/Sonnie&apos;s-Edge.jpg" class title="Sonnie" alt="s Edge">
<p>&#x6545;&#x4E8B;&#x53D1;&#x751F;&#x5728;&#x672A;&#x6765;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x53E3;&#x97F3;&#x4E0A;&#x5927;&#x6982;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x53D1;&#x751F;&#x5728;&#x82F1;&#x56FD;&#x3002;&#x6851;&#x59AE;&#x5229;&#x7528;&#x610F;&#x8BC6;&#x8FDE;&#x63A5;&#x64CD;&#x7EB5;&#x731B;&#x517D;&#x8FDB;&#x884C;&#x89D2;&#x6597;&#xFF0C;&#x53D6;&#x80DC;&#x4E4B;&#x540E;&#x5F15;&#x8D77;&#x4E86;&#x5BF9;&#x65B9;&#x8D22;&#x9600;&#x7684;&#x4E0D;&#x6EE1;&#xFF0C;&#x6D3E;&#x6740;&#x624B;&#x6740;&#x6B7B;&#x6851;&#x59AE;&#xFF0C;&#x53EF;&#x6851;&#x59AE;&#x65E9;&#x5C31;&#x5C06;&#x610F;&#x8BC6;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x6740;&#x6B7B;&#x7684;&#x90A3;&#x4E2A;&#x4E0D;&#x8FC7;&#x662F;&#x8EAF;&#x58F3;&#xFF0C;&#x8D22;&#x9600;&#x53C8;&#x88AB;&#x53CD;&#x6740;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x77ED;&#x7247;&#x7684;&#x6253;&#x6597;&#x573A;&#x9762;&#x975E;&#x5E38;&#x7CBE;&#x5F69;&#xFF0C;&#x6545;&#x4E8B;&#x8868;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x5267;&#x60C5;&#x540E;&#x9762;&#x900F;&#x9732;&#x51FA;&#x90A3;&#x4E2A;&#x4E16;&#x754C;&#x5DE8;&#x5927;&#x7684;&#x79D1;&#x6280;&#x8FDB;&#x6B65;&#x3002;&#x4EBA;&#x7C7B;&#x5BF9;&#x5176;&#x4ED6;&#x7269;&#x79CD;&#x7684;&#x610F;&#x8BC6;&#x63A7;&#x5236;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x64CD;&#x7EB5;&#x5B83;&#x4EEC;&#x6218;&#x6597;&#xFF0C;&#x6709;&#x5F88;&#x6D53;&#x7684;&#x8D5B;&#x535A;&#x670B;&#x514B;&#x98CE;&#x683C;&#x3002;</p>
<p>&#x77ED;&#x7247;&#x4E2D;&#x7B80;&#x77ED;&#x5730;&#x63D0;&#x5230;&#xFF0C;&#x6851;&#x59AE;&#x66FE;&#x7ECF;&#x906D;&#x5230;&#x8FC7;&#x5E2E;&#x6D3E;&#x7684;&#x5F3A;&#x5978;&#x548C;&#x4FAE;&#x8FB1;&#xFF0C;&#x4EC7;&#x6068;&#x8BA9;&#x5979;&#x9009;&#x62E9;&#x8FC7;&#x8FD9;&#x79CD;&#x5145;&#x6EE1;&#x66B4;&#x529B;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x7247;&#x5B50;&#x6709;&#x540E;&#x7EED;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x6210;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x72EC;&#x7ACB;&#x79D1;&#x5E7B;&#x7535;&#x5F71;&#x3002;</p>
<h2 id="&#x4E09;&#x4E2A;&#x673A;&#x5668;&#x4EBA;">&#x4E09;&#x4E2A;&#x673A;&#x5668;&#x4EBA;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/Three-Robots.jpg" class title="Three Robots">
<p>&#x5168;&#x7247;&#x7684;BGM&#x7565;&#x5E26;&#x8C03;&#x4F83;&#x7684;&#x5473;&#x9053;&#x3002;&#x5728;&#x4E00;&#x573A;&#x6BC1;&#x706D;&#x5168;&#x4EBA;&#x7C7B;&#x7684;&#x5927;&#x707E;&#x96BE;&#x4E4B;&#x540E;&#xFF0C;&#x4E09;&#x4E2A;&#x673A;&#x5668;&#x4EBA;&#x5728;&#x4EBA;&#x7C7B;&#x7684;&#x57CE;&#x5E02;&#x4E2D;&#x95F4;&#x6E38;&#x8361;&#xFF0C;&#x50CF;&#x8BDD;&#x75E8;&#x4E00;&#x6837;&#x7684;&#x804A;&#x5929;&#x3002;&#x5B83;&#x4EEC;&#x8D70;&#x8FC7;&#x9910;&#x5385;&#x3001;&#x4F53;&#x80B2;&#x9986;&#x3001;&#x519B;&#x4E8B;&#x57FA;&#x5730;&#xFF0C;&#x4EBA;&#x7C7B;&#x66FE;&#x7ECF;&#x7684;&#x7231;&#x3001;&#x6068;&#x3001;&#x75AF;&#x72C2;&#x3001;&#x8D2A;&#x5A6A;&#x90FD;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x5806;&#x5783;&#x573E;&#x3002;</p>
<p>&#x4E09;&#x4E2A;&#x673A;&#x5668;&#x4EBA;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x4EBA;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x628A;&#x98DF;&#x7269;&#x78BE;&#x788E;&#x7136;&#x540E;&#x4E22;&#x8FDB;&#x4E00;&#x4E2A;&#x88C5;&#x6EE1;&#x9178;&#x7684;&#x888B;&#x5B50;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4ED6;&#x4EEC;&#x8981;&#x8FFD;&#x4E00;&#x4E2A;&#x7403;&#x8DD1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x9020;&#x4E2A;&#x4F1A;&#x7206;&#x70B8;&#x7684;&#x5927;&#x67F1;&#x5B50;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x4EBA;&#x6B7B;&#x5F97;&#x66F4;&#x5FEB;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x7EA2;&#x8272;&#x7684;&#x5C0F;&#x673A;&#x5668;&#x4EBA;&#x597D;&#x53EF;&#x7231;&#xFF0C;&#x4F46;&#x5B83;&#x5750;&#x5728;&#x4E00;&#x9897;&#x9AB7;&#x9AC5;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x663E;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x53EF;&#x7231;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x662F;&#x55B5;&#x661F;&#x4EBA;&#x63A5;&#x7BA1;&#x4E86;&#x4E16;&#x754C;&#x2026;&#x2026;&#x53EF;&#x80FD;&#x4EBA;&#x7C7B;&#x706D;&#x7EDD;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x55B5;&#x661F;&#x4EBA;&#x63ED;&#x7AFF;&#x800C;&#x8D77;&#x4E86;&#x5427;&#x3002;</p>
<h2 id="&#x67B6;&#x7A7A;&#x5386;&#x53F2;">&#x67B6;&#x7A7A;&#x5386;&#x53F2;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/Histories-Alternate.jpg" class title="Histories Alternate">
<p>&#x672C;&#x96C6;&#x7684;&#x753B;&#x98CE;&#x6709;&#x70B9;&#x50CF;&#x8457;&#x540D;&#x7684;&#x52A8;&#x753B;&#x79D1;&#x666E;&#x680F;&#x76EE;<em>In a Nutshell</em>&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x680F;&#x76EE;&#xFF0C;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6709;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x7528;&#x6237;&#x64CD;&#x63A7;&#x5386;&#x53F2;&#x4EBA;&#x7269;&#x7684;&#x547D;&#x8FD0;&#xFF0C;&#x8FDB;&#x800C;&#x6539;&#x53D8;&#x4E16;&#x754C;&#x5386;&#x53F2;&#xFF0C;&#x4F60;&#x4F1A;&#x5982;&#x4F55;&#x64CD;&#x63A7;&#x5462;&#xFF1F;&#x77ED;&#x7247;&#x4E2D;&#x7ED9;&#x51FA;&#x4E86;&#x516D;&#x79CD;&#x8BA9;&#x5E0C;&#x7279;&#x52D2;&#x6B7B;&#x6389;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x662F;&#x5E0C;&#x7279;&#x52D2;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x65F6;&#x7684;&#x4ED6;&#x8FD8;&#x5728;&#x7EF4;&#x4E5F;&#x7EB3;&#x5B66;&#x4E60;&#x7ED8;&#x753B;&#x3002;&#x6BCF;&#x4E00;&#x79CD;&#x6B7B;&#x6CD5;&#x90FD;&#x5BFC;&#x51FA;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x7EBF;&#xFF0C;&#x5BFC;&#x81F4;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x79CD;&#x65CF;&#xFF0C;&#x4E0D;&#x540C;&#x751F;&#x7269;&#x5B8C;&#x6210;&#x4E86;&#x91CD;&#x5927;&#x7684;&#x5386;&#x53F2;&#x4E8B;&#x4EF6;&#xFF1A;&#x4E00;&#x6218;&#xFF0C;&#x4E8C;&#x6218;&#xFF0C;&#x767B;&#x6708;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x653F;&#x6CBB;&#x8BBD;&#x523A;&#x77ED;&#x7247;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5386;&#x53F2;&#x8FDB;&#x7A0B;&#x4E0D;&#x662F;&#x7531;&#x67D0;&#x4E2A;&#x4E2A;&#x4EBA;&#x6216;&#x8005;&#x5C11;&#x6570;&#x4EBA;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x91CF;&#x53D8;&#x5230;&#x8D28;&#x53D8;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5E0C;&#x7279;&#x52D2;&#x662F;&#x4E2A;&#x5927;&#x574F;&#x86CB;&#x6CA1;&#x9519;&#xFF0C;&#x4F46;&#x8BA9;&#x4ED6;&#x6B7B;&#x6389;&#x771F;&#x7684;&#x80FD;&#x907F;&#x514D;&#x5386;&#x53F2;&#x60B2;&#x5267;&#x7684;&#x53D1;&#x751F;&#x5417;&#xFF1F;</p>
<h2 id="&#x8BC1;&#x4EBA;">&#x8BC1;&#x4EBA;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/The-Witness.png" class title="The Witness">
<p>&#x7CBE;&#x5DE7;&#x7684;&#x95ED;&#x73AF;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x65E9;&#x6668;&#xFF0C;&#x5973;&#x4E3B;&#x5728;&#x623F;&#x95F4;&#x5316;&#x5986;&#xFF0C;&#x5FFD;&#x7136;&#x88AB;&#x4E00;&#x9635;&#x6025;&#x4FC3;&#x7684;&#x5DE8;&#x54CD;&#x5413;&#x5230;&#x3002;&#x58F0;&#x97F3;&#x662F;&#x4ECE;&#x7A97;&#x5916;&#x4F20;&#x6765;&#x7684;&#xFF0C;&#x5979;&#x5F00;&#x95E8;&#x5F80;&#x5916;&#x770B;&#xFF0C;&#x4E00;&#x4E2A;&#x8138;&#x4E0A;&#x5E26;&#x8840;&#x7684;&#x7537;&#x4EBA;&#x4E00;&#x8138;&#x60CA;&#x8BB6;&#x5730;&#x540C;&#x6837;&#x770B;&#x7740;&#x5979;&#xFF1A;&#x4ED6;&#x521A;&#x6740;&#x4E86;&#x4E00;&#x4E2A;&#x5993;&#x5973;&#xFF0C;&#x67AA;&#x53E3;&#x7684;&#x785D;&#x70DF;&#x8FD8;&#x5728;&#x7A7A;&#x6C14;&#x4E2D;&#x5F25;&#x6F2B;&#x3002;</p>
<p>&#x4ED6;&#x4F4E;&#x5934;&#x770B;&#x770B;&#x5C38;&#x4F53;&#xFF0C;&#x53C8;&#x671B;&#x5411;&#x5BF9;&#x9762;&#x7A97;&#x53E3;&#x7684;&#x90A3;&#x5F20;&#x8138;&#xFF0C;&#x53D1;&#x73B0;&#x5979;&#x4EEC;&#x7ADF;&#x7136;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x4E00;&#x573A;&#x8FFD;&#x9010;&#x620F;&#x4E0A;&#x6F14;&#xFF0C;&#x5973;&#x4E3B;&#x5728;&#x9003;&#x547D;&#x8FC7;&#x7A0B;&#x4E2D;&#x5728;&#x5993;&#x9662;&#x9E21;&#x5934;&#x7684;&#x62BD;&#x5C49;&#x91CC;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x628A;&#x67AA;&#xFF0C;&#x4E4B;&#x540E;&#xFF0C;&#x7537;&#x4E3B;&#x5C06;&#x5979;&#x5835;&#x5728;&#x4E86;&#x4E00;&#x95F4;&#x516C;&#x5BD3;&#x91CC;&#xFF0C;&#x4E00;&#x573A;&#x6253;&#x6597;&#x4E4B;&#x540E;&#x5973;&#x4E3B;&#x5F00;&#x67AA;&#x8BEF;&#x6740;&#x4E86;&#x7537;&#x4E3B;&#x3002;</p>
<p>&#x5916;&#x9762;&#x54CD;&#x8D77;&#x7A97;&#x6237;&#x6253;&#x5F00;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x5973;&#x4E3B;&#x5728;&#x75B2;&#x60EB;&#x4E2D;&#x62AC;&#x5934;&#x5411;&#x5916;&#x770B;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x7537;&#x4E3B;&#x60CA;&#x8BB6;&#x7684;&#x8138;&#x2026;&#x2026;</p>
<p>&#x77ED;&#x77ED;&#x5341;&#x51E0;&#x5206;&#x949F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8425;&#x9020;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x65F6;&#x7A7A;&#x4EA4;&#x9519;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x5341;&#x5206;&#x7684;&#x6293;&#x4EBA;&#x773C;&#x7403;&#x3002;&#x6545;&#x4E8B;&#x7684;&#x80CC;&#x666F;&#x53D1;&#x751F;&#x5728;&#x9999;&#x6E2F;&#xFF0C;&#x604D;&#x60DA;&#x95F4;&#x5012;&#x6709;&#x70B9;&#x513F;&#x300A;&#x91CD;&#x5E86;&#x68EE;&#x6797;&#x300B;&#x5473;&#x9053;&#x3002;</p>
<h2 id="&#x9F50;&#x9A6C;&#x7684;&#x4F5C;&#x54C1;">&#x9F50;&#x9A6C;&#x7684;&#x4F5C;&#x54C1;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/Zima-Blue.jpg" class title="Zima Blue">
<p>&#x8FD9;&#x4E00;&#x96C6;&#x662F;&#x4EE5;Alastair Reynolds&#x7684;&#x79D1;&#x5E7B;&#x4F5C;&#x54C1;<em>Zima Blue and Other Stories</em>&#x4E3A;&#x539F;&#x8457;&#x6539;&#x7F16;&#x7684;&#xFF0C;&#x8BB2;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x827A;&#x672F;&#x5BB6;&#x4E0D;&#x65AD;&#x8FFD;&#x5BFB;&#x771F;&#x7406;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x53EF;&#x4EE5;&#x7B97;&#x662F;&#x8FD9;18&#x4E2A;&#x77ED;&#x7247;&#x4E2D;&#x6700;&#x5177;&#x827A;&#x672F;&#x6027;&#x7684;&#x4E86;&#x3002;</p>
<p>&#x9F50;&#x9A6C;&#x7684;&#x8FC7;&#x53BB;&#x6CA1;&#x4EBA;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x5728;&#x4F5C;&#x54C1;&#x4E2D;&#x603B;&#x63A2;&#x8BA8;&#x5F88;&#x7EC8;&#x6781;&#x7684;&#x4E3B;&#x9898;&#x3002;&#x4ED6;&#x4E3A;&#x4E86;&#x80FD;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x5730;&#x4E86;&#x89E3;&#x771F;&#x7406;&#x548C;&#x5B87;&#x5B99;&#xFF0C;&#x4E0D;&#x60DC;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x6539;&#x9020;&#x6210;&#x5168;&#x673A;&#x68B0;&#x5316;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x4ED6;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6700;&#x9065;&#x8FDC;&#x7684;&#x661F;&#x7403;&#x6F2B;&#x6B65;&#xFF0C;&#x5728;&#x6700;&#x708E;&#x70ED;&#x7684;&#x5CA9;&#x6D46;&#x91CC;&#x9068;&#x6E38;&#x3002;</p>
<p>&#x6545;&#x4E8B;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x9F50;&#x9A6C;&#x5411;&#x8BB0;&#x8005;&#x503E;&#x8BC9;&#x81EA;&#x5DF1;&#x7684;&#x8FC7;&#x53BB;&#xFF1A;&#x4ED6;&#x66FE;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x88AB;&#x521B;&#x9020;&#x51FA;&#x6765;&#x6E05;&#x7406;&#x4E3B;&#x4EBA;&#x5BB6;&#x7684;&#x6CF3;&#x6C60;&#xFF0C;&#x4EBA;&#x7C7B;&#x4E0D;&#x65AD;&#x5730;&#x5728;&#x5B83;&#x8EAB;&#x4E0A;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8BA9;&#x5B83;&#x53D8;&#x5F97;&#x66F4;&#x50CF;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5177;&#x6709;&#x667A;&#x6167;&#xFF0C;&#x80FD;&#x5B8C;&#x6210;&#x5404;&#x79CD;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x9F50;&#x9A6C;&#x6700;&#x540E;&#x7684;&#x4F5C;&#x54C1;&#x4E0D;&#x518D;&#x62D8;&#x6CE5;&#x4E8E;&#x753B;&#x4F5C;&#xFF0C;&#x4ED6;&#x7EB5;&#x8EAB;&#x8DC3;&#x8FDB;&#x6CF3;&#x6C60;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x6240;&#x6709;&#x7684;&#x96F6;&#x4EF6;&#x62C6;&#x89E3;&#xFF0C;&#x53EA;&#x5269;&#x4E0B;&#x90A3;&#x4E2A;&#x4E13;&#x5FC3;&#x6E05;&#x7406;&#x6CF3;&#x6C60;&#x7684;&#x5C0F;&#x673A;&#x5668;&#x4EBA;&#x3002;</p>
<p>&#x53EF;&#x80FD;&#x662F;&#x9F50;&#x9A6C;&#x88AB;&#x6539;&#x9020;&#x4E4B;&#x540E;&#x7684;&#x8EAB;&#x4F53;&#x5524;&#x9192;&#x4E86;&#x673A;&#x68B0;&#x539F;&#x672C;&#x7684;&#x56DE;&#x5FC6;&#xFF0C;&#x5267;&#x4E2D;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x7EBF;&#x7D22;&#x3002;&#x4F46;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x8868;&#x73B0;&#x7684;&#x4E3B;&#x9898;&#x5F88;&#x6709;&#x8DA3;&#xFF1A;&#x79D1;&#x6280;&#x7684;&#x63A2;&#x7D22;&#x5230;&#x6700;&#x540E;&#x662F;&#x5426;&#x4F1A;&#x56DE;&#x5230;&#x539F;&#x70B9;&#xFF1F;&#x8FFD;&#x6C42;&#x9AD8;&#x6280;&#x672F;&#x7684;&#x811A;&#x6B65;&#x8D70;&#x5F97;&#x8D8A;&#x8FDC;&#xFF0C;&#x6211;&#x4EEC;&#x539F;&#x521D;&#x7684;&#x5FEB;&#x4E50;&#x662F;&#x5426;&#x53D8;&#x5C11;&#x4E86;&#xFF1F;</p>
<h2 id="&#x72E9;&#x730E;&#x6109;&#x5FEB;">&#x72E9;&#x730E;&#x6109;&#x5FEB;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/Good-Hunting.jpg" class title="Good Hunting">
<p>&#x8FD9;&#x90E8;&#x77ED;&#x7247;&#x662F;&#x4EE5;&#x534E;&#x4EBA;&#x79D1;&#x5E7B;&#x4F5C;&#x5BB6;&#x5218;&#x5B87;&#x6606;&#x7684;&#x540C;&#x540D;&#x5C0F;&#x8BF4;&#x6539;&#x7F16;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4F4D;&#x6B63;&#x662F;&#x300A;&#x4E09;&#x4F53;&#x300B;&#x82F1;&#x6587;&#x7248;&#x7684;&#x8BD1;&#x4F5C;&#x8005;&#xFF0C;&#x300A;&#x4E09;&#x4F53;&#x300B;&#x80FD;&#x591F;&#x5728;&#x56FD;&#x9645;&#x4E0A;&#x4EAB;&#x6709;&#x58F0;&#x8A89;&#xFF0C;&#x548C;&#x4ED6;&#x7684;&#x7FFB;&#x8BD1;&#x662F;&#x5206;&#x4E0D;&#x5F00;&#x7684;&#x3002;</p>
<p>&#x6545;&#x4E8B;&#x8BB2;&#x8FF0;&#x4E86;&#x5728;20&#x4E16;&#x7EAA;&#x7684;&#x9999;&#x6E2F;&#xFF0C;&#x673A;&#x68B0;&#x65F6;&#x4EE3;&#x548C;&#x53E4;&#x4EE3;&#x795E;&#x8BDD;&#x5996;&#x9B3C;&#x53D1;&#x751F;&#x7684;&#x78B0;&#x649E;&#x3002;&#x7537;&#x4E3B;&#x5C0F;&#x65F6;&#x5019;&#x8DDF;&#x968F;&#x7236;&#x4EB2;&#x6349;&#x72D0;&#x72F8;&#x7CBE;&#xFF0C;&#x5728;&#x8FFD;&#x6740;&#x4E00;&#x53EA;&#x72D0;&#x72F8;&#x7CBE;&#x5230;&#x5979;&#x7684;&#x5DE2;&#x7A74;&#x65F6;&#xFF0C;&#x7537;&#x4E3B;&#x9047;&#x89C1;&#x4E86;&#x5973;&#x4E3B;&#x2014;&#x2014;&#x4E00;&#x53EA;&#x5C0F;&#x72D0;&#x72F8;&#x3002;</p>
<p>&#x65F6;&#x5149;&#x834F;&#x82D2;&#xFF0C;&#x82F1;&#x56FD;&#x4EBA;&#x7684;&#x94C1;&#x8DEF;&#x4FEE;&#x8FDB;&#x4E86;&#x9999;&#x6E2F;&#xFF0C;&#x72D0;&#x72F8;&#x7CBE;&#x7684;&#x9B54;&#x6CD5;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x4EE5;&#x65BD;&#x5C55;&#xFF0C;&#x53EA;&#x80FD;&#x4E00;&#x76F4;&#x88AB;&#x56F0;&#x5728;&#x4EBA;&#x5F62;&#x3002;&#x7537;&#x4E3B;&#x627E;&#x5230;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E2E;&#x82F1;&#x56FD;&#x4EBA;&#x7EF4;&#x4FEE;&#x94C1;&#x8DEF;&#xFF0C;&#x638C;&#x63E1;&#x4E86;&#x5F88;&#x591A;&#x673A;&#x68B0;&#x77E5;&#x8BC6;&#x3002;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x4ED6;&#x8FD8;&#x80FD;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x7075;&#x5DE7;&#x7684;&#x81EA;&#x52A8;&#x673A;&#x68B0;&#x3002;</p>
<p>&#x5728;&#x5973;&#x4E3B;&#x906D;&#x9047;&#x4E86;&#x60B2;&#x60E8;&#x7684;&#x547D;&#x8FD0;&#xFF0C;&#x88AB;&#x4EBA;&#x6539;&#x9020;&#x6210;&#x4E86;&#x673A;&#x68B0;&#x4EBA;&#x4EE5;&#x540E;&#xFF0C;&#x7537;&#x4E3B;&#x5E2E;&#x52A9;&#x5979;&#x5B8C;&#x6210;&#x4E86;&#x8715;&#x53D8;&#xFF1A;&#x53EF;&#x4EE5;&#x5728;&#x673A;&#x68B0;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x5B8C;&#x6210;&#x4ECE;&#x4EBA;&#x5230;&#x72D0;&#x72F8;&#x7684;&#x8F6C;&#x53D8;&#xFF0C;&#x62A5;&#x590D;&#x90A3;&#x4E9B;&#x884C;&#x4E0D;&#x4E49;&#x4E4B;&#x4EBA;&#x3002;</p>
<p>&#x77ED;&#x7247;&#x4F7F;&#x7528;&#x624B;&#x7ED8;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x5012;&#x662F;&#x5F88;&#x50CF;&#x5BAB;&#x5D0E;&#x9A8F;&#x7684;&#x300A;&#x54C8;&#x5C14;&#x7684;&#x79FB;&#x52A8;&#x57CE;&#x5821;&#x300B;&#xFF0C;&#x4ED9;&#x4FA0;&#x52A0;&#x4E0A;&#x84B8;&#x6C7D;&#x670B;&#x514B;&#xFF0C;&#x8BA9;&#x4EBA;&#x8033;&#x76EE;&#x4E00;&#x65B0;&#x3002;</p>
<h2 id="&#x5F53;&#x9178;&#x5976;&#x7EDF;&#x6CBB;&#x4E16;&#x754C;">&#x5F53;&#x9178;&#x5976;&#x7EDF;&#x6CBB;&#x4E16;&#x754C;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/When-the-Yogurt-Took-Over.jpg" class title="When the Yogurt Took Over">
<p>&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x9ED1;&#x8272;&#x5E7D;&#x9ED8;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x9178;&#x5976;&#x62E5;&#x6709;&#x4E86;&#x610F;&#x8BC6;&#xFF0C;&#x5E76;&#x88AB;&#x8D4B;&#x4E88;&#x4E86;&#x7EDF;&#x6CBB;&#x4E16;&#x754C;&#x7684;&#x6743;&#x5229;&#xFF0C;&#x6211;&#x4EEC;&#x8BE5;&#x4F55;&#x53BB;&#x4F55;&#x4ECE;&#xFF1F;</p>
<p>&#x77ED;&#x7247;&#x4E00;&#x672C;&#x6B63;&#x7ECF;&#x5730;&#x8BA8;&#x8BBA;&#x4E86;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#x6027;&#xFF1A;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5C06;&#x6700;&#x5F3A;&#x7684;DNA&#x6CE8;&#x5165;&#x4E73;&#x9178;&#x83CC;&#x7684;&#x4F53;&#x5185;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x8FDB;&#x5316;&#x6210;&#x4E86;&#x6709;&#x610F;&#x8BC6;&#x7684;&#x751F;&#x7269;&#x3002;&#x5B83;&#x4EEC;&#x5411;&#x7F8E;&#x56FD;&#x653F;&#x5E9C;&#x63D0;&#x51FA;&#x6761;&#x4EF6;&#xFF0C;&#x7ED9;&#x6211;&#xFF08;&#x4EEC;&#xFF09;&#x4FC4;&#x4EA5;&#x4FC4;&#x5DDE;&#xFF0C;&#x6211;&#x5C06;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x6700;&#x5B8C;&#x7F8E;&#x7684;&#x7ECF;&#x6D4E;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x7ED3;&#x679C;&#xFF0C;&#x8BC1;&#x660E;&#x6CA1;&#x6709;&#x542C;&#x4ECE;&#x9178;&#x5976;&#x7684;&#x63D0;&#x6848;&#xFF0C;&#x5BFC;&#x81F4;&#x7ECF;&#x6D4E;&#x4E0B;&#x6ED1;&#xFF0C;&#x4EBA;&#x6C11;&#x6613;&#x5B50;&#x76F8;&#x98DF;&#xFF0C;&#x53EA;&#x6709;&#x4FC4;&#x4EA5;&#x4FC4;&#x5DDE;&#x5E78;&#x514D;&#x4E8E;&#x96BE;&#x3002;&#x603B;&#x7EDF;&#x8FEB;&#x4E8E;&#x538B;&#x529B;&#x4EA4;&#x51FA;&#x6743;&#x5229;&#xFF0C;&#x9178;&#x5976;&#x4ECE;&#x6B64;&#x638C;&#x7BA1;&#x4E16;&#x754C;&#x3002;&#x4E16;&#x754C;&#x5728;&#x9178;&#x5976;&#x7684;&#x7EDF;&#x6CBB;&#x4E0B;&#x7ECF;&#x6D4E;&#x63D0;&#x632F;&#xFF0C;&#x4EBA;&#x6C11;&#x5B89;&#x5C45;&#x4E50;&#x4E1A;&#x3002;</p>
<p>&#x5FFD;&#x7136;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x9178;&#x5976;&#x4EEC;&#x9020;&#x51FA;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x9178;&#x5976;&#x74F6;&#x4E00;&#x6837;&#x7684;&#x98DE;&#x884C;&#x5668;&#x79BB;&#x5F00;&#x4E86;&#x5730;&#x7403;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;&#x524D;&#x5F80;&#x5916;&#x661F;&#x7684;&#x5F81;&#x9014;&#x3002;&#x53EF;&#x662F;&#x5B83;&#x4EEC;&#x79BB;&#x5F00;&#x4EE5;&#x540E;&#xFF0C;&#x4EBA;&#x7C7B;&#x8BE5;&#x4F55;&#x53BB;&#x4F55;&#x4ECE;&#x5462;&#xFF1F;</p>
<h2 id="&#x51B0;&#x6CB3;&#x65F6;&#x4EE3;">&#x51B0;&#x6CB3;&#x65F6;&#x4EE3;</h2>
<img src="/2019/04/03/%E7%88%B1%EF%BC%8C%E6%AD%BB%E4%BA%A1%E5%92%8C%E6%9C%BA%E5%99%A8%E4%BA%BA/Ice-Age.jpg" class title="Ice Age">
<p>&#x4F5B;&#x8BED;&#x8BF4;&#xFF0C;&#x4E00;&#x82B1;&#x4E00;&#x4E16;&#x754C;&#x3002;&#x7537;&#x4E3B;&#x548C;&#x5973;&#x4E3B;&#x642C;&#x8FDB;&#x4E86;&#x65B0;&#x5BB6;&#xFF0C;&#x53D1;&#x73B0;&#x623F;&#x4E1C;&#x7559;&#x4E0B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x8001;&#x65E7;&#x7684;&#x51B0;&#x7BB1;&#xFF0C;&#x4ED6;&#x628A;&#x51B0;&#x7BB1;&#x91CC;&#x5806;&#x79EF;&#x7684;&#x51B0;&#x638F;&#x51FA;&#x6765;&#xFF0C;&#x5374;&#x610F;&#x5916;&#x5730;&#x53D1;&#x73B0;&#x51B0;&#x7BB1;&#x91CC;&#x6709;&#x4E2A;&#x5931;&#x843D;&#x7684;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x770B;&#x7740;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x4ECE;&#x51B0;&#x6CB3;&#x65F6;&#x4EE3;&#x53D1;&#x5C55;&#x5230;&#x519C;&#x8015;&#x6587;&#x660E;&#xFF0C;&#x518D;&#x5230;&#x5DE5;&#x4E1A;&#x9769;&#x547D;&#x5E26;&#x6765;&#x4E86;&#x673A;&#x68B0;&#x548C;&#x7535;&#x529B;&#xFF0C;&#x6B65;&#x5165;&#x73B0;&#x4EE3;&#x6587;&#x660E;&#x3002;&#x5C31;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x4E00;&#x9897;&#x6838;&#x5F39;&#x7A81;&#x7136;&#x7206;&#x70B8;&#xFF0C;&#x6BC1;&#x706D;&#x4E86;&#x57CE;&#x5E02;&#xFF0C;&#x6BC1;&#x706D;&#x4E86;&#x4E00;&#x5207;&#x3002;&#x7537;&#x4E3B;&#x5F88;&#x60B2;&#x4F24;&#xFF0C;&#x5173;&#x4E0A;&#x51B0;&#x7BB1;&#xFF0C;&#x5E76;&#x70B9;&#x4E86;&#x5757;&#x62AB;&#x8428;&#x5403;&#x3002;</p>
<p>&#x5403;&#x5B8C;&#x62AB;&#x8428;&#x4EE5;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x53C8;&#x6253;&#x5F00;&#x51B0;&#x7BB1;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5DF2;&#x7ECF;&#x53D1;&#x5C55;&#x5230;&#x4E86;&#x795E;&#x7EA7;&#x6587;&#x660E;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x65E0;&#x6570;&#x98DE;&#x8239;&#x5728;&#x697C;&#x5B87;&#x95F4;&#x7A7F;&#x884C;&#xFF0C;&#x4E0D;&#x4E45;&#x4EE5;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x521B;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x866B;&#x6D1E;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x4F20;&#x9001;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x65F6;&#x7A7A;&#xFF0C;&#x4E00;&#x5207;&#x5F52;&#x4E8E;&#x5E73;&#x9759;&#x3002;</p>
<p>&#x51B0;&#x7BB1;&#x91CC;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x65E0;&#x8BBA;&#x521B;&#x9020;&#x4E86;&#x591A;&#x4E48;&#x8F89;&#x714C;&#x7684;&#x6587;&#x660E;&#xFF0C;&#x7ECF;&#x5386;&#x8FC7;&#x591A;&#x5C11;&#x75DB;&#x82E6;&#xFF0C;&#x90A3;&#x4E24;&#x4E2A;&#x201C;&#x4E0A;&#x5E1D;&#x201D;&#x53EA;&#x9700;&#x8981;&#x5173;&#x4E0A;&#x51B0;&#x7BB1;&#x95E8;&#xFF0C;&#x62D4;&#x6389;&#x63D2;&#x5934;&#xFF0C;&#x4E00;&#x5207;&#x5C31;&#x6D88;&#x5931;&#x4E86;&#x3002;&#x4F1A;&#x4E0D;&#x4F1A;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x7684;&#x4E16;&#x754C;&#x4E5F;&#x4EC5;&#x4EC5;&#x5B58;&#x5728;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x4EBA;&#x7684;&#x51B0;&#x7BB1;&#x91CC;&#x5462;&#xFF1F;</p>
<hr>
<h2 id="&#x77ED;&#x7247;&#x4E4B;&#x5916;&#x7684;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;">&#x77ED;&#x7247;&#x4E4B;&#x5916;&#x7684;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;</h2>
<p>&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x8FD8;&#x6709;&#x5F88;&#x597D;&#x7684;&#x77ED;&#x7247;&#x6CA1;&#x6709;&#x8BB2;&#x5230;&#xFF0C;&#x5305;&#x62EC;&#x4E86;&#x5F02;&#x79CD;&#x5165;&#x4FB5;&#x3001;&#x592A;&#x7A7A;&#x63A2;&#x7D22;&#x7B49;&#x7B49;&#x5F88;&#x68D2;&#x7684;&#x79D1;&#x5E7B;&#x4E3B;&#x9898;&#xFF0C;&#x90FD;&#x662F;&#x503C;&#x5F97;&#x4E00;&#x770B;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7CFB;&#x5217;&#x77ED;&#x7247;&#x7531;&#x7F51;&#x7EDC;&#x89C6;&#x9891;&#x70B9;&#x64AD;&#x516C;&#x53F8;Netflix&#x51FA;&#x54C1;&#x3002;&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5411;&#x4F20;&#x7EDF;&#x7535;&#x5F71;&#x5E02;&#x573A;&#x6D89;&#x8DB3;&#x7684;&#x6B21;&#x6570;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x53BB;&#x5E74;&#x83B7;&#x5F97;&#x5965;&#x65AF;&#x5361;&#x6700;&#x4F73;&#x539F;&#x521B;&#x5267;&#x672C;&#x7684;&#x300A;&#x6D77;&#x8FB9;&#x7684;&#x66FC;&#x5F7B;&#x65AF;&#x7279;&#x300B;&#x5C31;&#x662F;&#x51FA;&#x81EA;&#x4E9A;&#x9A6C;&#x900A;&#x7684;&#x624B;&#x7B14;&#x3002;&#x53EF;&#x80FD;&#x5728;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x66F4;&#x591A;&#x5730;&#x770B;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x5411;&#x7535;&#x5F71;&#x6CE8;&#x5165;&#x7684;&#x65B0;&#x9C9C;&#x8840;&#x6DB2;&#x3002;</p>
<p>&#x8BE5;&#x5267;&#x96C6;&#x7531;&#x5927;&#x536B;&#x82AC;&#x5947;&#x3001;&#x8482;&#x59C6;&#x7C73;&#x52D2;&#x7275;&#x5934;&#x5236;&#x4F5C;&#xFF0C;&#x6574;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x6765;&#x6E90;&#x662F;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x6784;&#x601D;&#x7684;&#x53E6;&#x4E00;&#x90E8;&#x7535;&#x5F71;<em>Heavy Metal</em>&#x3002;&#x8BF4;&#x8D77;&#x8FD9;&#x4E24;&#x4F4D;&#xFF0C;&#x7B97;&#x662F;&#x597D;&#x83B1;&#x575E;&#x5927;&#x540D;&#x9876;&#x9876;&#x7684;&#x5BFC;&#x6F14;&#x4E86;&#x3002;&#x300A;&#x4E03;&#x5B97;&#x7F6A;&#x300B;&#x3001;&#x300A;&#x640F;&#x51FB;&#x4FF1;&#x4E50;&#x90E8;&#x300B;&#x3001;&#x300A;&#x7EB8;&#x724C;&#x5C4B;&#x300B;&#x90FD;&#x662F;&#x5927;&#x536B;&#x82AC;&#x5947;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x800C;&#x6F2B;&#x5A01;&#x7C89;&#x5F88;&#x719F;&#x6089;&#x7684;&#x300A;&#x6B7B;&#x4F8D;&#x300B;&#x7B2C;&#x4E00;&#x90E8;&#x662F;&#x8482;&#x59C6;&#x7C73;&#x52D2;&#x7684;&#x4F5C;&#x54C1;&#x3002;&#x4E0D;&#x8FC7;&#x5267;&#x96C6;&#x4E2D;&#x7684;&#x91CD;&#x53E3;&#x5473;&#x5143;&#x7D20;&#xFF0C;&#x53EF;&#x80FD;&#x548C;&#x8FD9;&#x4E24;&#x4F4D;&#x7684;&#x7279;&#x6B8A;&#x504F;&#x597D;&#x6709;&#x4E9B;&#x5173;&#x7CFB;&#x3002;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/电影/">电影</a>
    </span>
    

    </div>

    
  </div>
</article>

  






    </main>

    <footer class="site-footer">
  <!-- <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
    </br>
    
    &copy; 2019 玩味者
    
  </p> -->
</footer>
    
  </div>
</div>
</body>
</html>