<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  
  <title>从“三分损益法”说起 | 玩味者 | 玩味者的理性空间</title>

  

  
  <meta name="description" content="历史

司马迁《史记·律书》有云
律数：九九八十一以为宫。三分去一，五十四以为徵。三分益一，七十二以为商。三分去一，四十八以为羽。三分益一，六十四以为角。

上面所记载的就是所谓的“三分损益法”，描述的是规定“五音”的方法。翻译过来，大概是做这么一件事：">
  

  
  
  <meta name="keywords" content="数学,音乐">
  

  <meta id="viewport" name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no, minimal-ui">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta name="apple-mobile-web-app-status-bar-style" content="black">

  <meta property="og:title" content="从“三分损益法”说起"/>

  <meta property="og:site_name" content="玩味者"/>

  
  <meta property="og:image" content="/favicon.ico"/>
  

  <link href="/favicon.ico" rel="icon">
  <link rel="alternate" href="/atom.xml" title="玩味者" type="application/atom+xml">
  <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
</head>


<body>
<div class="blog">
  <div class="content">

    <header>
  <div class="site-branding">
    <h1 class="site-title">
      <a href="/">玩味者</a>
    </h1>
    <p class="site-description">玩味者的理性空间</p>
  </div>
  <nav class="site-navigation">
    <ul>
      
        <li><a href="../../../../index.html">主页</a></li>
      
        <li><a href="../../../../archives">归档</a></li>
      
    </ul>
  </nav>
</header>

    <main class="site-main posts-loop">
    <article>

  
    
    <h3 class="article-title"><span>从“三分损益法”说起</span></h3>
    
  

  <div class="article-top-meta">
    <span class="posted-on">
      <a href="/2020/03/12/从“三分损益法”说起/" rel="bookmark">
        <time class="entry-date published" datetime="2020-03-12T04:01:31.000Z">
          2020-03-12
        </time>
      </a>
    </span>
  </div>


  

  <div class="article-content">
    <div class="entry">
      
        <h2 id="&#x5386;&#x53F2;">&#x5386;&#x53F2;</h2>
<blockquote>
<p>&#x53F8;&#x9A6C;&#x8FC1;&#x300A;&#x53F2;&#x8BB0;&#xB7;&#x5F8B;&#x4E66;&#x300B;&#x6709;&#x4E91;</p>
<p>&#x5F8B;&#x6570;&#xFF1A;&#x4E5D;&#x4E5D;&#x516B;&#x5341;&#x4E00;&#x4EE5;&#x4E3A;&#x5BAB;&#x3002;&#x4E09;&#x5206;&#x53BB;&#x4E00;&#xFF0C;&#x4E94;&#x5341;&#x56DB;&#x4EE5;&#x4E3A;&#x5FB5;&#x3002;&#x4E09;&#x5206;&#x76CA;&#x4E00;&#xFF0C;&#x4E03;&#x5341;&#x4E8C;&#x4EE5;&#x4E3A;&#x5546;&#x3002;&#x4E09;&#x5206;&#x53BB;&#x4E00;&#xFF0C;&#x56DB;&#x5341;&#x516B;&#x4EE5;&#x4E3A;&#x7FBD;&#x3002;&#x4E09;&#x5206;&#x76CA;&#x4E00;&#xFF0C;&#x516D;&#x5341;&#x56DB;&#x4EE5;&#x4E3A;&#x89D2;&#x3002;</p>
</blockquote>
<p>&#x4E0A;&#x9762;&#x6240;&#x8BB0;&#x8F7D;&#x7684;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x4E09;&#x5206;&#x635F;&#x76CA;&#x6CD5;&#x201D;&#xFF0C;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x89C4;&#x5B9A;&#x201C;&#x4E94;&#x97F3;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x505A;&#x8FD9;&#x4E48;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;</p>
<a id="more"></a>
<p>&#x53D6;&#x4E00;&#x6839;&#x5185;&#x58C1;&#x5149;&#x6ED1;&#x7684;&#x7AF9;&#x7BA1;&#xFF0C;&#x89C4;&#x5B9A;&#x7AF9;&#x7BA1;&#x5439;&#x54CD;&#x7684;&#x8FD9;&#x4E2A;&#x97F3;&#x4E3A;&#x201C;&#x5BAB;&#x201D;&#xFF1B;&#x5C06;&#x7AF9;&#x7BA1;&#x5206;&#x4E3A;81&#x4EFD;&#xFF0C;&#x5728;2/3&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x7B2C;54&#x4EFD;&#xFF09;&#x6253;&#x4E00;&#x4E2A;&#x5B54;&#xFF0C;&#x6B64;&#x65F6;&#x5439;&#x54CD;&#x7684;&#x97F3;&#x79F0;&#x4E3A;&#x201C;&#x5FB5;&#x201D;&#xFF1B;&#x7EE7;&#x7EED;&#x4EE5;54&#x4EFD;&#x4E3A;&#x57FA;&#x7840;&#x4E58;&#x4EE5;4/3&#x5F97;&#x5230;&#x7B2C;72&#x4EFD;&#xFF0C;&#x79F0;&#x4E3A;&#x201C;&#x5546;&#x201D;&#xFF1B;&#x518D;&#x4EE5;72&#x4EFD;&#x4E3A;&#x57FA;&#x7840;&#x4E58;&#x4EE5;2/3&#xFF0C;&#x5F97;&#x5230;48&#xFF0C;&#x79F0;&#x4E3A;&#x201C;&#x7FBD;&#x201D;&#xFF1B;48&#x518D;&#x4E58;&#x4EE5;4/3&#xFF0C;&#x5F97;&#x5230;&#x201C;&#x89D2;&#x201D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7684;&#x201C;&#x4E94;&#x97F3;&#x201D;&#xFF1A;&#x5BAB;&#x3001;&#x5546;&#x3001;&#x89D2;&#x3001;&#x5FB5;&#x3001;&#x7FBD;&#x3002;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x6765;&#x7684;&#x3002;&#x4F46;&#x53EF;&#x522B;&#x4EE5;&#x4E3A;&#x53E4;&#x4EBA;&#x5C31;&#x53EA;&#x5728;&#x7AF9;&#x7BA1;&#x4E0A;&#x6253;&#x4E86;&#x4E94;&#x4E2A;&#x6D1E;&#xFF0C;&#x6309;&#x300A;&#x53F2;&#x8BB0;&#x300B;&#x7684;&#x539F;&#x6587;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8BB0;&#x5F55;&#x4E86;&#x4E00;&#x6BB5;&#x8BA9;&#x4EBA;&#x5934;&#x76AE;&#x53D1;&#x9EBB;&#x7684;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>&#x9EC4;&#x953A;&#x957F;&#x516B;&#x5BF8;&#x4E03;&#x5206;&#x4E00;&#xFF0C;&#x5BAB;&#x3002;&#x5927;&#x5415;&#x957F;&#x4E03;&#x5BF8;&#x4E94;&#x5206;&#x4E09;&#x5206;&#x3002;&#x592A;&#x851F;&#x957F;&#x4E03;&#x5BF8;&#x5206;&#x4E8C;&#xFF0C;&#x89D2;&#x3002;&#x5939;&#x953A;&#x957F;&#x516D;&#x5BF8;&#x5206;&#x4E09;&#x5206;&#x4E00;&#x3002;&#x59D1;&#x6D17;&#x957F;&#x516D;&#x5BF8;&#x5206;&#x56DB;&#xFF0C;&#x7FBD;&#x3002;&#x4EF2;&#x5415;&#x957F;&#x4E94;&#x5BF8;&#x4E5D;&#x5206;&#x4E09;&#x5206;&#x4E8C;&#xFF0C;&#x5FB5;&#x3002;&#x8564;&#x5BBE;&#x957F;&#x4E94;&#x5BF8;&#x516D;&#x5206;&#x4E09;&#x5206;&#x3002;&#x6797;&#x953A;&#x957F;&#x4E94;&#x5BF8;&#x5206;&#x56DB;&#xFF0C;&#x89D2;&#x3002;&#x5937;&#x5219;&#x957F;&#x4E94;&#x5BF8;&#x4E09;&#x5206;&#x4E8C;&#xFF0C;&#x5546;&#x3002;&#x5357;&#x5415;&#x957F;&#x56DB;&#x5BF8;&#x5206;&#x516B;&#xFF0C;&#x5FB5;&#x3002;&#x65E0;&#x5C04;&#x957F;&#x56DB;&#x5BF8;&#x56DB;&#x5206;&#x4E09;&#x5206;&#x4E8C;&#x3002;&#x5E94;&#x953A;&#x957F;&#x56DB;&#x5BF8;&#x4E8C;&#x5206;&#x4E09;&#x5206;&#x4E8C;&#xFF0C;&#x7FBD;&#x3002;&#x751F;&#x953A;&#x5206;&#xFF1A;&#x5B50;&#x4E00;&#x5206;&#x3002;&#x4E11;&#x4E09;&#x5206;&#x4E8C;&#x3002;&#x5BC5;&#x4E5D;&#x5206;&#x516B;&#x3002;&#x536F;&#x4E8C;&#x5341;&#x4E03;&#x5206;&#x5341;&#x516D;&#x3002;&#x8FB0;&#x516B;&#x5341;&#x4E00;&#x5206;&#x516D;&#x5341;&#x56DB;&#x3002;&#x5DF3;&#x4E8C;&#x767E;&#x56DB;&#x5341;&#x4E09;&#x5206;&#x4E00;&#x767E;&#x4E8C;&#x5341;&#x516B;&#x3002;&#x5348;&#x4E03;&#x767E;&#x4E8C;&#x5341;&#x4E5D;&#x5206;&#x4E94;&#x767E;&#x4E00;&#x5341;&#x4E8C;&#x3002;&#x672A;&#x4E8C;&#x5343;&#x4E00;&#x767E;&#x516B;&#x5341;&#x4E03;&#x5206;&#x4E00;&#x5343;&#x4E8C;&#x5341;&#x56DB;&#x3002;&#x7533;&#x516D;&#x5343;&#x4E94;&#x767E;&#x516D;&#x5341;&#x4E00;&#x5206;&#x56DB;&#x5343;&#x4E5D;&#x5341;&#x516D;&#x3002;&#x9149;&#x4E00;&#x4E07;&#x4E5D;&#x5343;&#x516D;&#x767E;&#x516B;&#x5341;&#x4E09;&#x5206;&#x516B;&#x5343;&#x4E00;&#x767E;&#x4E5D;&#x5341;&#x4E8C;&#x3002;&#x620C;&#x4E94;&#x4E07;&#x4E5D;&#x5343;&#x56DB;&#x5341;&#x4E5D;&#x5206;&#x4E09;&#x4E07;&#x4E8C;&#x5343;&#x4E03;&#x767E;&#x516D;&#x5341;&#x516B;&#x3002;&#x4EA5;&#x5341;&#x4E03;&#x4E07;&#x4E03;&#x5343;&#x4E00;&#x767E;&#x56DB;&#x5341;&#x4E03;&#x5206;&#x516D;&#x4E07;&#x4E94;&#x5343;&#x4E94;&#x767E;&#x4E09;&#x5341;&#x516D;&#x3002;</p>
</blockquote>
<p>&#x4EE5;&#x4E0A;&#x8FD9;&#x4E48;&#x4E00;&#x5927;&#x6BB5;&#x8DB3;&#x53EF;&#x89C1;&#x4E2D;&#x56FD;&#x53E4;&#x4EBA;&#x7684;&#x7B97;&#x672F;&#x80FD;&#x529B;&#x662F;&#x591A;&#x4E48;&#x53EF;&#x6015;&#xFF0C;&#x5728;&#x4E94;&#x97F3;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x53C8;&#x884D;&#x751F;&#x51FA;&#x4E86;&#x201C;&#x9EC4;&#x953A;&#x201D;&#xFF0C;&#x201C;&#x5927;&#x5415;&#x201D;&#xFF0C;&#x201C;&#x592A;&#x851F;&#x201D;&#x7B49;&#x7B49;&#xFF0C;&#x8D8A;&#x5206;&#x8D8A;&#x5BC6;&#x3002;</p>
<p>&#x65E0;&#x72EC;&#x6709;&#x5076;&#xFF0C;&#x5728;&#x53E4;&#x4EE3;&#x7684;&#x897F;&#x65B9;&#xFF0C;&#x4E5F;&#x6709;&#x89C4;&#x5B9A;&#x4E50;&#x5668;&#x97F3;&#x9AD8;&#x7684;&#x97F3;&#x5F8B;&#x7CFB;&#x7EDF;&#xFF0C;&#x5373;&#x201C;&#x4E94;&#x5EA6;&#x76F8;&#x751F;&#x5F8B;&#x201D;&#x3002;&#x636E;&#x4F20;&#x8FD9;&#x662F;&#x7531;&#x6BD5;&#x8FBE;&#x54E5;&#x62C9;&#x65AF;&#x63D0;&#x51FA;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x8BF4;&#xFF0C;&#x4E94;&#x5EA6;&#x76F8;&#x751F;&#x5F8B;&#x662F;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p>&#x53D6;&#x4E00;&#x6839;&#x957F;&#x5EA6;&#x4E3A;1&#x7684;&#x7EF7;&#x7D27;&#x7684;&#x5F26;&#xFF1A;&#x89C4;&#x5B9A;&#x5F39;&#x54CD;&#x8FD9;&#x6839;&#x5F26;&#x7684;&#x58F0;&#x97F3;&#x4E3A;C&#xFF1B;&#x628A;&#x5F26;&#x7684;&#x957F;&#x5EA6;&#x7F29;&#x77ED;1/3&#xFF0C;&#x5F97;&#x5230;G&#xFF1B;&#x7136;&#x540E;&#x518D;&#x628A;G&#x5EF6;&#x957F;1/3&#x5F97;&#x5230;D&#xFF1B;&#x518D;&#x51CF;&#x53BB;D&#x7684;1/3&#x5F97;&#x5230;A&#xFF1B;&#x518D;&#x5EF6;&#x957F;A&#x7684;1/3&#x5F97;&#x5230;E&#xFF1B;&#x518D;&#x51CF;&#x53BB;E&#x7684;1/3&#x5F97;&#x5230;B&#xFF1B;&#x6700;&#x540E;&#xFF0C;&#x4EE5;C&#x7684;3/4&#x957F;&#x5EA6;&#x7684;&#x97F3;&#x8BB0;&#x4E3A;F</p>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x5F26;&#x957F;&#x7531;&#x957F;&#x5230;&#x77ED;&#x6765;&#x6392;&#x5217;&#xFF0C;&#x4F9D;&#x6B21;&#x662F;&#xFF1A;C, D, E, F, G, A, B</p>
<p>&#x4E0D;&#x7BA1;&#x662F;&#x97F3;&#x4E50;&#x4E13;&#x4E1A;&#x7684;&#x670B;&#x53CB;&#x8FD8;&#x662F;&#x7B80;&#x5355;&#x5B66;&#x8FC7;&#x4E50;&#x7406;&#x77E5;&#x8BC6;&#x7684;&#x5BF9;&#x8FD9;&#x51E0;&#x4E2A;&#x97F3;&#x540D;&#x90FD;&#x4E0D;&#x4F1A;&#x964C;&#x751F;&#xFF0C;&#x5B83;&#x4EEC;&#x6784;&#x6210;&#x4E86;&#x73B0;&#x4EE3;&#x97F3;&#x4E50;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x897F;&#x65B9;&#x97F3;&#x4E50;&#x4E2D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4E03;&#x4E2A;&#x97F3;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x8FD8;&#x80FD;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x5F97;&#x5230;&#x534A;&#x97F3;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x7684;&#x4E94;&#x5EA6;&#x5708;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x5BF9;&#x5386;&#x53F2;&#x7684;&#x8BA8;&#x8BBA;&#x5230;&#x8FD9;&#x91CC;&#x4E3A;&#x6B62;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x96BE;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<img src="/2020/03/12/%E4%BB%8E%E2%80%9C%E4%B8%89%E5%88%86%E6%8D%9F%E7%9B%8A%E6%B3%95%E2%80%9D%E8%AF%B4%E8%B5%B7/1024px_Circle_of_fifths_deluxe_4.png" class title="&#x4E94;&#x5EA6;&#x5708;">
<h2 id="&#x632F;&#x52A8;">&#x632F;&#x52A8;</h2>
<p>&#x4ECE;&#x7269;&#x7406;&#x4E0A;&#x8BF4;&#xFF0C;&#x7269;&#x4F53;&#x7684;&#x632F;&#x52A8;&#x9891;&#x7387;&#x5982;&#x679C;&#x8FBE;&#x5230;&#x4E86;&#x4EBA;&#x8033;&#x53EF;&#x4EE5;&#x5BDF;&#x89C9;&#x7684;&#x6700;&#x4F4E;&#x9891;&#x7387;&#xFF08;&#x4E00;&#x822C;&#x662F;27Hz&#xFF09;&#xFF0C;&#x5B83;&#x5C31;&#x53D1;&#x51FA;&#x4E86;&#x58F0;&#x97F3;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x7684;&#x632F;&#x52A8;&#x53EF;&#x4EE5;&#x662F;&#x591A;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x662F;&#x7B80;&#x8C10;&#x632F;&#x52A8;&#xFF0C;&#x6BD4;&#x5982;&#x5355;&#x6446;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5355;&#x6446;&#x7684;&#x6446;&#x52A8;&#x901F;&#x5EA6;&#x8DB3;&#x591F;&#x5FEB;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5B83;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4E50;&#x5668;&#x7684;&#xFF0C;&#x4F46;&#x6CA1;&#x4EBA;&#x90A3;&#x4E48;&#x505A;&#xFF0C;&#x4E00;&#x822C;&#x4E50;&#x5668;&#x7684;&#x53D1;&#x58F0;&#x65E0;&#x5916;&#x4E4E;&#x8FD9;&#x4E48;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x5F26;&#x7684;&#x632F;&#x52A8;&#xFF08;&#x63D0;&#x7434;&#xFF0C;&#x5409;&#x4ED6;&#xFF0C;&#x94A2;&#x7434;&#x7B49;&#xFF09;&#x3001;&#x7A7A;&#x8154;&#x7684;&#x632F;&#x52A8;&#xFF08;&#x57D9;&#xFF0C;&#x7B1B;&#x5B50;&#x7B49;&#xFF09;&#x3001;&#x91D1;&#x5C5E;&#x6216;&#x5176;&#x4ED6;&#x56FA;&#x4F53;&#x7684;&#x632F;&#x52A8;&#xFF08;&#x78EC;&#xFF0C;&#x7F16;&#x949F;&#xFF0C;&#x53E3;&#x7434;&#x7B49;&#xFF09;</p>
<p>&#x800C;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x7684;&#x632F;&#x52A8;&#xFF0C;&#x8FD9;&#x91CC;&#x7B80;&#x5316;&#x4E00;&#x4E0B;&#xFF0C;&#x5047;&#x5B9A;&#x8FD9;&#x4E2A;&#x632F;&#x52A8;&#x7684;&#x9891;&#x7387;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x6B63;&#x5F26;&#x6CE2;&#xFF0C;&#x90A3;&#x4E48;&#x9664;&#x4E86;&#x5B83;&#x7684;&#x9891;&#x7387;&#x4EE5;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x91CF;&#x662F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#xFF1A;&#x5E45;&#x5EA6;&#x548C;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E9B;&#x4E5F;&#x9700;&#x8981;&#x5728;&#x4E50;&#x7406;&#x4E2D;&#x52A0;&#x4EE5;&#x89C4;&#x5B9A;&#x3002;</p>
<p>&#x5F39;&#x8FC7;&#x5F26;&#x4E50;&#x5668;&#x7684;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5F26;&#x4E50;&#x80FD;&#x53D1;&#x51FA;&#x4E00;&#x79CD;&#x5F88;&#x7A7A;&#x7075;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x79F0;&#x4E3A;&#x6CDB;&#x97F3;&#xFF0C;&#x8FD9;&#x662F;&#x827A;&#x672F;&#x754C;&#x7684;&#x53EB;&#x6CD5;&#xFF0C;&#x5728;&#x58F0;&#x5B66;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x53D1;&#x58F0;&#x6A21;&#x5F0F;&#x79F0;&#x4E3A;<strong>&#x8C10;&#x6CE2;</strong>&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x7B2C;&#x4E00;&#x884C;&#x4E2D;&#xFF0C;&#x5F26;&#x7684;&#x632F;&#x52A8;&#x6A21;&#x5F0F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x57FA;&#x6CE2;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x5411;&#x4E0B;&#x5206;&#x522B;&#x4E3A;<strong>1&#x6B21;&#x8C10;&#x6CE2;</strong>&#xFF0C;<strong>2&#x6B21;&#x8C10;&#x6CE2;</strong>&#x7B49;&#x7B49;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x8C10;&#x6CE2;&#x632F;&#x52A8;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x5F26;&#x7684;&#x5206;&#x70B9;&#x662F;&#x4E0D;&#x52A8;&#x7684;&#x3002;&#x7529;&#x8FC7;&#x957F;&#x7EF3;&#x7684;&#x4EBA;&#x5E94;&#x8BE5;&#x80FD;&#x660E;&#x767D;&#x6211;&#x8FD9;&#x8BDD;&#x7684;&#x610F;&#x601D;</p>
<img src="/2020/03/12/%E4%BB%8E%E2%80%9C%E4%B8%89%E5%88%86%E6%8D%9F%E7%9B%8A%E6%B3%95%E2%80%9D%E8%AF%B4%E8%B5%B7/harmonic.png" class title="&#x8C10;&#x6CE2;">
<blockquote>
<p>&#x4E0D;&#x6B62;&#x58F0;&#x5B66;&#x4E2D;&#x6709;&#x8C10;&#x6CE2;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5728;&#x7535;&#x5B66;&#x4E2D;&#xFF0C;&#x4FE1;&#x53F7;&#x4E5F;&#x662F;&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6CE2;&#xFF08;&#x7535;&#x78C1;&#x6CE2;&#xFF09;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x4F46;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8C10;&#x6CE2;&#x53EF;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x597D;&#x4E1C;&#x897F;&#xFF0C;&#x7531;&#x4E8E;&#x6709;&#x8C10;&#x6CE2;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4F1A;&#x7ED9;&#x901A;&#x4FE1;&#x4EA7;&#x751F;&#x5E72;&#x6270;</p>
</blockquote>
<h2 id="&#x4EBA;&#x8033;&#x662F;&#x5F88;&#x96BE;&#x4F3A;&#x5019;&#x7684;">&#x4EBA;&#x8033;&#x662F;&#x5F88;&#x96BE;&#x4F3A;&#x5019;&#x7684;</h2>
<p>&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x57FA;&#x672C;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x5728;&#x97F3;&#x4E50;&#x4E2D;&#xFF0C;&#x5982;&#x4F55;&#x5B9A;&#x51FA;C, D, E, F, G, A, B&#x8FD9;&#x51E0;&#x4E2A;&#x97F3;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x7ED3;&#x5408;&#x521A;&#x521A;&#x7684;&#x201C;&#x4E94;&#x5EA6;&#x76F8;&#x751F;&#x5F8B;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x53EF;&#x80FD;&#x662F;&#xFF1A;&#x201C;&#x6309;&#x4E94;&#x5EA6;&#x76F8;&#x751F;&#x5F8B;&#x6765;&#x7684;&#x554A;&#x3002;&#x201D;</p>
<p>&#x53EF;&#x4EE5;&#x5982;&#x679C;&#x8FDB;&#x4E00;&#x6B65;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E94;&#x5EA6;&#x76F8;&#x751F;&#x5F8B;&#x5B9A;&#x51FA;&#x7684;&#x97F3;&#x5C31;&#x597D;&#x5462;&#xFF1F;&#x4E00;&#x6839;&#x5F26;&#x4E0A;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x79CD;&#x957F;&#x5EA6;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x90FD;&#x53EF;&#x4EE5;&#x5F39;&#x594F;&#x51FA;&#x58F0;&#x97F3;&#xFF0C;&#x4E3A;&#x4F55;&#x5355;&#x5355;&#x5C31;&#x62FF;&#x51FA;&#x90A3;&#x4E48;&#x51E0;&#x4E2A;&#x97F3;&#xFF1F;</p>
<p>&#x4E00;&#x79CD;&#x611F;&#x6027;&#x7684;&#x56DE;&#x7B54;&#x662F;&#xFF1A;&#x8FD9;&#x51E0;&#x4E2A;&#x97F3;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x60A6;&#x8033;&#x3002;&#x90A3;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x6CA1;&#x6709;&#x56DE;&#x7B54;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x8033;&#x6735;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x80FD;&#x67D0;&#x4E9B;&#x4EBA;&#x89C9;&#x5F97;&#x597D;&#x542C;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x4EBA;&#x89C9;&#x5F97;&#x4E0D;&#x597D;&#x542C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6682;&#x4E14;&#x628A;&#x95EE;&#x9898;&#x653E;&#x4E0B;&#xFF0C;&#x5C06;&#x6CE8;&#x610F;&#x529B;&#x653E;&#x5230;&#x90A3;&#x6839;&#x7EF7;&#x7D27;&#x7684;&#x5F26;&#x4E0A;&#x3002;</p>
<hr>
<p>&#x8BBE;&#x957F;&#x5EA6;&#x4E3A;1&#x7684;&#x5F26;&#x594F;&#x54CD;&#x7684;&#x58F0;&#x97F3;&#x7684;&#x9891;&#x7387;&#x662F;f&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5728;&#x957F;&#x5EA6;&#x4E3A;1/2&#x7684;&#x5F26;&#x4E0A;&#x5F39;&#x594F;&#x51FA;&#x7684;&#x58F0;&#x97F3;&#x5C31;&#x4E00;&#x5B9A;&#x662F;2f&#x3002;&#x4ECE;&#x6570;&#x5B66;&#x4E0A;&#x8BF4;&#xFF0C;<strong>&#x5F26;&#x7684;&#x957F;&#x5EA6;&#x548C;&#x80FD;&#x594F;&#x54CD;&#x7684;&#x58F0;&#x97F3;&#x9891;&#x7387;&#x5448;&#x53CD;&#x6BD4;</strong>&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5C06;&#x4E24;&#x4E2A;&#x4E92;&#x76F8;&#x4E4B;&#x95F4;&#x9891;&#x7387;&#x6BD4;&#x4E3A;2&#x7684;&#x58F0;&#x97F3;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x751F;&#x6210;&#x7684;&#x58F0;&#x97F3;&#x4F1A;&#x5982;&#x4F55;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x7528;&#x6B63;&#x5F26;&#x6CE2;&#x505A;&#x4E2A;&#x5B9E;&#x9A8C;&#x770B;&#x770B;&#xFF0C;&#x5C31;&#x50CF;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x4E24;&#x4E2A;&#x4E92;&#x76F8;&#x4E4B;&#x95F4;&#x9891;&#x7387;&#x6BD4;&#x4E3A;2&#x7684;&#x6B63;&#x5F26;&#x6CE2;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x6CE2;&#x5F62;&#x4ECD;&#x7136;&#x662F;&#x89C4;&#x5219;&#x7684;</p>
<img src="/2020/03/12/%E4%BB%8E%E2%80%9C%E4%B8%89%E5%88%86%E6%8D%9F%E7%9B%8A%E6%B3%95%E2%80%9D%E8%AF%B4%E8%B5%B7/%E6%AD%A3%E5%BC%A6%E6%B3%A2%E7%9A%84%E5%8F%A0%E5%8A%A0.png" class title="&#x6B63;&#x5F26;&#x6CE2;&#x7684;&#x53E0;&#x52A0;">
<p>&#x53EF;&#x662F;&#x5982;&#x679C;&#x5C06;&#x4E24;&#x4E2A;&#x9891;&#x7387;&#x6BD4;&#x4E0D;&#x6210;&#x6BD4;&#x4F8B;&#x7684;&#x6CE2;&#x53E0;&#x52A0;&#x5728;&#x4E00;&#x8D77;&#x5462;</p>
<img src="/2020/03/12/%E4%BB%8E%E2%80%9C%E4%B8%89%E5%88%86%E6%8D%9F%E7%9B%8A%E6%B3%95%E2%80%9D%E8%AF%B4%E8%B5%B7/%E6%AD%A3%E5%BC%A6%E6%B3%A2%E7%9A%84%E5%8F%A0%E5%8A%A02.png" class title="&#x6B63;&#x5F26;&#x6CE2;&#x7684;&#x53E0;&#x52A0;2">
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6CE2;&#x5F62;&#x53D8;&#x5F97;&#x6DF7;&#x4E71;&#x65E0;&#x89C4;&#x5F8B;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;<strong>&#x6CE2;&#x5F62;&#x89C4;&#x5F8B;&#x7684;&#x632F;&#x52A8;&#x5BF9;&#x4E8E;&#x4EBA;&#x8033;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x548C;&#x8C10;&#x7684;&#xFF0C;&#x800C;&#x6CE2;&#x5F62;&#x4E0D;&#x89C4;&#x5F8B;&#x7684;&#x632F;&#x52A8;&#x5C31;&#x662F;&#x4E0D;&#x548C;&#x8C10;&#x7684;&#xFF0C;&#x662F;&#x566A;&#x58F0;</strong>&#xFF0C;&#x800C;&#x4ECE;&#x6570;&#x5B66;&#x4E0A;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x5F97;&#x5230;&#xFF0C;&#x4E24;&#x4E2A;&#x97F3;&#x4E4B;&#x95F4;&#x8D8A;&#x63A5;&#x8FD1;&#x6574;&#x6570;&#x6BD4;&#xFF0C;&#x7EC4;&#x5408;&#x5F97;&#x5230;&#x7684;&#x6CE2;&#x5F62;&#x5C31;&#x8D8A;&#x89C4;&#x6574;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x201C;&#x4E09;&#x5206;&#x635F;&#x76CA;&#x6CD5;&#x201D;&#x548C;&#x201C;&#x4E94;&#x5EA6;&#x76F8;&#x751F;&#x5F8B;&#x201D;&#x90FD;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x6BD4;&#x4F8B;&#x589E;&#x51CF;&#x7684;&#x539F;&#x56E0;</p>
<h2 id="&#x97F3;&#x5F8B;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;">&#x97F3;&#x5F8B;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;</h2>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x201C;&#x4E09;&#x5206;&#x635F;&#x76CA;&#x6CD5;&#x201D;&#x8FD8;&#x662F;&#x201C;&#x4E94;&#x5EA6;&#x76F8;&#x751F;&#x5F8B;&#x201D;&#x5728;&#x5386;&#x53F2;&#x957F;&#x6CB3;&#x4E2D;&#x90FD;&#x5DF2;&#x7ECF;&#x88AB;&#x6DD8;&#x6C70;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF1A;&#x5728;&#x4F5C;&#x66F2;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x9700;&#x8981;&#x51E0;&#x4E2A;&#x97F3;&#x540C;&#x65F6;&#x594F;&#x54CD;&#xFF08;&#x4E50;&#x7406;&#x4E2D;&#x79F0;&#x4E3A;&#x548C;&#x58F0;&#x6216;&#x8005;&#x548C;&#x5F26;&#xFF09;&#xFF0C;&#x548C;&#x8C10;&#x5173;&#x7CFB;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x6253;&#x7834;&#xFF0C;&#x800C;&#x7531;&#x4EE5;&#x4E0A;&#x7684;&#x4E24;&#x79CD;&#x97F3;&#x5F8B;&#x7CFB;&#x7EDF;&#x5F97;&#x5230;&#x7684;&#x5355;&#x97F3;&#x4E4B;&#x95F4;&#xFF0C;&#x9891;&#x7387;&#x6BD4;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x67D0;&#x51E0;&#x4E2A;&#x97F3;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x548C;&#x8C10;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E9B;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x5C31;&#x975E;&#x5E38;&#x96BE;&#x542C;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x897F;&#x65B9;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;&#x5F88;&#x591A;&#x79CD;&#x97F3;&#x5F8B;&#x7CFB;&#x7EDF;&#x7684;&#x6539;&#x8FDB;&#x65B9;&#x6848;&#xFF0C;&#x5305;&#x62EC;&#x201C;&#x7EAF;&#x5F8B;&#x201D;&#x3001;&#x201C;&#x4E2D;&#x5EB8;&#x5F8B;&#x201D;&#x7B49;&#x7B49;&#xFF0C;&#x4F46;&#x90FD;&#x6CA1;&#x6709;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x6298;&#x4E2D;</p>
<p>&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x516B;&#x5EA6;&#x4E2D;&#x5305;&#x62EC;&#x5168;&#x97F3;&#x548C;&#x534A;&#x97F3;&#xFF0C;&#x4E00;&#x5171;&#x6709;12&#x4E2A;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x9700;&#x8981;&#x8BA9;&#x6BCF;&#x4E2A;&#x97F3;&#x7684;&#x7EC4;&#x5408;&#x90FD;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x548C;&#x8C10;&#x5173;&#x7CFB;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x8BA9;&#x8FD9;&#x5341;&#x4E8C;&#x4E2A;&#x97F3;&#x7684;&#x9891;&#x7387;&#x6BD4;&#x5448;&#x73B0;&#x4E00;&#x4E2A;&#x7B49;&#x6BD4;&#x6570;&#x5217;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x3002;&#x4E24;&#x4E2A;&#x76F8;&#x90BB;&#x5355;&#x97F3;&#x7684;&#x9891;&#x7387;&#x6BD4;&#x5E94;&#x8BE5;&#x662F;2&#x7684;12&#x6B21;&#x65B9;&#x6839;&#x3002;</p>
<p>&#x800C;&#x8FD9;&#x4E2A;&#x6570;&#x5230;&#x5E95;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x897F;&#x65B9;&#x4EBA;&#x8FDF;&#x8FDF;&#x7B97;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x5386;&#x53F2;&#x7684;&#x8F6C;&#x6298;&#x6765;&#x81EA;&#x4E2D;&#x56FD;&#xFF0C;&#x660E;&#x671D;&#x4E00;&#x4E2A;&#x53EB;&#x6731;&#x8F7D;&#x5809;&#x7684;&#x6570;&#x5B66;&#x5BB6;&#xFF0C;&#x5728;&#x4ED6;&#x7684;&#x8457;&#x4F5C;&#x300A;&#x4E50;&#x5F8B;&#x5168;&#x4E66;&#x300B;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x7528;81&#x4F4D;&#x7684;&#x7B97;&#x76D8;&#x5C06;2&#x7684;12&#x6B21;&#x65B9;&#x6839;&#x8BA1;&#x7B97;&#x5230;&#x4E86;&#x5C0F;&#x6570;&#x70B9;&#x540E;25&#x4F4D;&#xFF0C;&#x5373;1.059463094359295264561825&#xFF0C;&#x5E76;&#x7531;&#x6B64;&#x5F97;&#x5230;&#x4E86;12&#x4E2A;&#x5355;&#x97F3;&#x76F8;&#x5BF9;&#x97F3;&#x9AD8;&#x7684;&#x7CBE;&#x786E;&#x7ED3;&#x679C;</p>
<p>&#x8FD9;&#x4E2A;&#x6210;&#x679C;&#x7ECF;&#x8FC7;&#x4F20;&#x6559;&#x58EB;&#x5229;&#x739B;&#x7AA6;&#x4ECB;&#x7ECD;&#x5230;&#x4E86;&#x897F;&#x65B9;&#xFF0C;&#x201C;&#x5341;&#x4E8C;&#x5E73;&#x5747;&#x5F8B;&#x201D;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x6700;&#x4F18;&#x7684;&#x97F3;&#x5F8B;&#x7CFB;&#x7EDF;&#x88AB;&#x56FA;&#x5B9A;&#x4E0B;&#x6765;&#xFF0C;&#x5E76;&#x4E00;&#x76F4;&#x6CBF;&#x7528;&#x5230;&#x4E86;&#x4ECA;&#x5929;&#x3002;&#x5FB7;&#x56FD;&#x4EBA;&#x5728;&#x5341;&#x4E8C;&#x5E73;&#x5747;&#x5F8B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5236;&#x9020;&#x4E86;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x94A2;&#x7434;&#xFF1B;&#x8FD9;&#x8FD8;&#x4FC3;&#x6210;&#x4E86;&#x897F;&#x65B9;&#x53E4;&#x5178;&#x4E50;&#x4E2D;&#x5BF9;&#x4F4D;&#x6CD5;&#x7684;&#x53D1;&#x5C55;&#xFF1B;&#x7531;&#x4E8E;&#x6BCF;&#x4E24;&#x4E2A;&#x97F3;&#x4E4B;&#x95F4;&#x7684;&#x9891;&#x7387;&#x5173;&#x7CFB;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x53D8;&#x8C03;&#x4E5F;&#x4E0D;&#x4F1A;&#x8BA9;&#x4E50;&#x66F2;&#x7684;&#x542C;&#x611F;&#x51FA;&#x73B0;&#x504F;&#x5DEE;&#xFF1B;&#x800C;&#x5DF4;&#x8D6B;&#x5728;&#x5341;&#x4E8C;&#x5E73;&#x5747;&#x5F8B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8C31;&#x5199;&#x7684;&#x300A;&#x5E73;&#x5747;&#x5F8B;&#x952E;&#x76D8;&#x66F2;&#x96C6;&#x300B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5728;&#x897F;&#x65B9;&#x53E4;&#x5178;&#x97F3;&#x4E50;&#x4E2D;&#x6700;&#x5177;&#x5F71;&#x54CD;&#x529B;&#x7684;&#x4F5C;&#x54C1;&#x3002;</p>

      
    </div>

  </div>

  <div class="article-footer">
    <div class="article-meta pull-left">

    

    
    

    <span class="post-tags">
      <i class="icon-tags"></i>
        <a href="/tags/数学/">数学</a><a href="/tags/音乐/">音乐</a>
    </span>
    

    </div>

    
  </div>
</article>

  






    </main>

    <footer class="site-footer">
  <!-- <p class="site-info">
    Proudly powered by <a href="https://hexo.io/" target="_blank">Hexo</a> and
    Theme by <a href="https://github.com/CodeDaraW/Hacker" target="_blank">Hacker</a>
    </br>
    
    &copy; 2020 玩味者
    
  </p> -->
</footer>
    
  </div>
</div>
</body>
</html>